package tui

import "github.com/charmbracelet/lipgloss"

var logoStyle = lipgloss.NewStyle().
	Foreground(lipgloss.Color("#A855F7")).
	Bold(true)

var logo = `
 ██████╗ ██╗      ██████╗ ██╗   ██╗██████╗  ██████╗  ██████╗
 ██╔══██╗██║     ██╔═══██╗╚██╗ ██╔╝██╔══██╗██╔═══██╗██╔═══██╗
 ██████╔╝██║     ██║   ██║ ╚████╔╝ ██║  ██║██║   ██║██║   ██║
 ██╔═══╝ ██║     ██║   ██║  ╚██╔╝  ██║  ██║██║   ██║██║   ██║
 ██║     ███████╗╚██████╔╝   ██║   ██████╔╝╚██████╔╝╚██████╔╝
 ╚═╝     ╚══════╝ ╚═════╝    ╚═╝   ╚═════╝  ╚═════╝  ╚═════╝`

var signatureStyle = lipgloss.NewStyle().
	Foreground(lipgloss.Color("#7C3AED")).
	Italic(true)

func renderLogo() string {
	return logoStyle.Render(logo) + "\n" + signatureStyle.Render(" by spaguetti-coder")
}
